{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "41b37aba-0987-4bc0-aa70-86d8819f01b6",
   "metadata": {},
   "source": [
    "<h2> 1. Сигмоидальная функция активации </h2> \r\n",
    "В этом задании вам нужно написать программу для вычисления результата сигмоидальной функции активации для заданных входных данных (два числа — (x1\r\n",
    " и x2)\r\n",
    ") и коэффициентов. Ваша задача — дописать недостающие фрагменты кода."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "a2b46188-b44f-410b-944e-f98f3215e895",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0.6456563062257954\n"
     ]
    }
   ],
   "source": [
    "import math\n",
    "\n",
    "# Функция сигмоид\n",
    "def sigmoid(x):\n",
    "    return 1 / (1 + math.exp(-x))\n",
    "\n",
    "# Задаем коэффициенты a и b\n",
    "a = 0.5\n",
    "b = 0.2\n",
    "\n",
    "# Входные данные\n",
    "x1 = 1.0\n",
    "x2 = 0.5\n",
    "\n",
    "# Линейная комбинация\n",
    "linear_combination = a * x1 + b * x2\n",
    "\n",
    "# Применяем функцию активации (сигмоид)\n",
    "output = sigmoid(linear_combination)\n",
    "\n",
    "# Выводим результат\n",
    "print(output)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e77f0e1b-c1ee-4e46-838f-5a0352514129",
   "metadata": {},
   "source": [
    "<h2> 2. Вычисление свертки </h2>\r\n",
    "Вам дана матрица A размером 5x5 и матрица фильтра F размером 3x3. Примените операцию свертки между матрицей A и матрицей F и получите выходную матрицу C.\r\n",
    "\r\n",
    "Алгоритм свертки:\r\n",
    "\r\n",
    "1.\tПроходя по каждой строке матрицы A, возьмите окно размером 3x3 начиная с первого элемента и перемножьте его с матрицей фильтра F. Сложите результаты умножения, чтобы получить первый элемент выходной матрицы C.\r\n",
    "\r\n",
    "2.\tПовторите шаг 1 для всех других элементов строки A, чтобы заполнить первую строку матрицы C.\r\n",
    "\r\n",
    "3.\tПовторите шаги 1–2 для всех оставшихся строк матрицы A, чтобы заполнить оставшиеся строки матрицы C.\r\n",
    "\r\n",
    "Часть кода уже представлена, ваша задача – дописать недостающие фрагменты кода."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "f3ec75fd-de80-44b0-a239-bb751137f0ef",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[[-2.  0.  2.]\n",
      " [ 8. 10. 12.]\n",
      " [18. 20. 22.]]\n"
     ]
    }
   ],
   "source": [
    "import numpy as np\n",
    "\n",
    "# создаем исходную матрицу A размером 5x5\n",
    "A = np.array([[1, 2, 3, 4, 5], \n",
    "              [6, 7, 8, 9, 10], \n",
    "              [11, 12, 13, 14, 15], \n",
    "              [16, 17, 18, 19, 20], \n",
    "              [21, 22, 23, 24, 25]])\n",
    "\n",
    "# создаем матрицу фильтра F размером 3x3\n",
    "F = np.array([[1, 2, -1], \n",
    "              [1, 0, -1], \n",
    "              [1, 0, -1]])\n",
    "\n",
    "# определяем размеры матриц A и F\n",
    "height_a, width_a = A.shape\n",
    "height_f, width_f = F.shape\n",
    "\n",
    "# инициализируем выходную матрицу C\n",
    "output_height = height_a - height_f + 1\n",
    "output_width = width_a - width_f + 1\n",
    "C = np.zeros((output_height, output_width))\n",
    "\n",
    "# проходим по каждой строке матрицы A\n",
    "for i in range(output_height):\n",
    "    # проходим по каждому столбцу матрицы A\n",
    "    for j in range(output_width):\n",
    "        # получаем окно размером 3x3, начиная с текущей позиции\n",
    "        window = A[i:i + height_f, j:j + width_f]\n",
    "        # перемножаем окно с матрицей фильтра\n",
    "        result = window * F\n",
    "        # суммируем результаты умножения, чтобы получить новое значение в выходной матрице C\n",
    "        C[i, j] = np.sum(result)\n",
    "\n",
    "print(C)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "92316b82-d15f-489b-85b7-5e045d1c7aa3",
   "metadata": {},
   "source": [
    "<h2> 3. Реализация простой нейросети </h2>\r\n",
    "Вам даны искусственно созданные данные, представленные в виде матрицы размером 100x3. Реализуйте простую нейросеть, состоящую из одного входного слоя, одного скрытого слоя и одного выходного слоя. Размер скрытого слоя должен быть равен 5.\r\n",
    "\r\n",
    "В качестве функции активации используйте сигмоидальную функцию. Вычислите ошибку обучения (среднеквадратичное отклонение) и выведите ее на экран.\r\n",
    "\r\n",
    "Часть кода уже представлена, ваша задача — дописать недостающие фрагменты кода."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "dba8a73a-5df8-4d91-be5e-3e4ba41597e3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1.0962720396017545\n"
     ]
    }
   ],
   "source": [
    "# Создаем искусственные данные\n",
    "import numpy as np\n",
    "np.random.seed(42)\n",
    "\n",
    "X = np.random.randn(100, 5)  # матрица 100x5\n",
    "\n",
    "# Определяем архитектуру нейронной сети\n",
    "input_size = 5\n",
    "hidden_size = 3\n",
    "output_size = 1\n",
    "\n",
    "# Инициализируем веса случайным образом\n",
    "W1 = np.random.randn(input_size, hidden_size)  # матрица весов 5x3\n",
    "W2 = np.random.randn(hidden_size, output_size)  # матрица весов 3x1\n",
    "\n",
    "# Определяем функцию активации\n",
    "def sigmoid(x):\n",
    "    return 1 / (1 + np.exp(-x))\n",
    "\n",
    "# Прямой проход по нейронной сети\n",
    "hidden_layer = sigmoid(np.dot(X, W1))  # скрытый слой\n",
    "output_layer = np.dot(hidden_layer, W2)  # выходной слой\n",
    "\n",
    "# Вычисляем среднеквадратичную ошибку\n",
    "y_true = np.random.randn(100, 1)  # реальные значения\n",
    "mse = np.mean((output_layer - y_true) ** 2)\n",
    "\n",
    "print(mse)\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
